# Binaries
brew 'ast-grep'
brew 'bash' # Latest Bash version
brew 'bat' # Used for spatie/visit
brew 'coreutils' # Those that come with macOS are outdated
brew 'curl'
brew 'fd'
brew 'fnm'
brew 'fzf'
brew 'gh'
brew 'git'
brew 'grep'
brew 'httpie'
brew 'jq' # Used for spatie/visit
brew 'lazygit'
brew 'mas' # Mac App Store manager
brew 'neovim'
brew 'powerlevel10k'
# brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'prettyping'
brew 'restic'
brew 'ripgrep'
brew 'speedtest-cli'
brew 'tree' # List directories in a tree structure
brew 'wget'
brew 'zsh-autosuggestions'

# Spatie Medialibrary
# brew 'jpegoptim'
# brew 'optipng'
# brew 'pngquant'
# brew 'svgo'
# brew 'gifsicle'

# Development
# brew 'php'
# brew 'argon2'
# brew 'composer'
# brew 'imagemagick'
# brew 'meilisearch'
# brew 'mysql'
# brew 'nginx'
# brew 'node'
# brew 'pnpm'
# brew 'redis'
# brew 'yarn'

# Apps
# Note: Logitech Options+ installed via ./install-logitech-options.sh (offline version preferred)
cask '1password'
brew '1password-cli'
cask 'airbuddy'
cask 'aldente'
cask 'appcleaner'
cask 'brave-browser'
cask 'calibre'
# cask 'carbon-copy-cloner'
cask 'contraste'
# cask 'dbngin'
# cask 'discord'
# cask 'docker'
cask 'firefox'
# cask 'flux'
cask 'ghostty'
cask 'github'
cask 'google-chrome'
cask 'grandperspective'
cask 'iina'
cask 'imageoptim'
cask 'jordanbaird-ice'
cask 'keka'
cask 'localsend'
# cask 'maestral'
cask 'monitorcontrol'
cask 'notion'
cask 'numi'
cask 'obsidian'
# cask 'phpmon'
# cask 'phpstorm'
# cask 'ray'
cask 'raycast'
# cask 'readdle-spark'
# cask 'roon'
# cask 'scapple'
cask 'sdformatter'
# cask 'setapp'
cask 'signal'
cask 'shottr'
cask 'stats'
cask 'sublime-merge'
cask 'sublime-text'
# cask 'syncthing'
cask 'tempbox'
cask 'thingsmacsandboxhelper'
# cask 'tidal'
cask 'transmission'
cask 'utm'
cask 'visual-studio-code'
cask 'vlc'

# Fonts
cask 'font-iosevka'
cask 'font-iosevka-term-nerd-font'
cask 'font-jetbrains-mono-nerd-font'
cask 'font-monaspace-nf'

# Mac App Store
mas 'Amphetamine', id: 937984704
mas 'Dato', id: 1470584107
mas 'Disk Speed Test', id: 425264550
mas 'Endel', id: 1346247457
mas 'Instapaper', id: 288545208
mas 'iPreview', id: 1519213509
mas 'NextDNS', id: 1464122853
# mas 'Paprika Recipe Manager 3', id: 1303222628
mas 'Parcel', id: 639968404
mas 'Pixelmator Pro', id: 1289583905
mas 'Things', id: 904280696
