# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'nicoverbruggen/homebrew-cask'

# Binaries
brew 'argon2'
brew 'bash' # Latest Bash version
brew 'bat'
brew 'coreutils' # Those that come with macOS are outdated
brew 'curl'
brew 'gh'
brew 'git'
brew 'gnupg'
brew 'grep'
brew 'htop'
brew 'hub'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'prettyping'
brew 'restic'
brew 'speedtest-cli'
brew 'syncthing'
brew 'tree' # List directories in a tree structure
brew 'vim'
brew 'zlib' # Needed for Memcached

# Spatie Medialibrary
brew 'jpegoptim'
brew 'optipng'
brew 'pngquant'
brew 'svgo'
brew 'gifsicle'

# Development
brew 'php'
brew 'composer'
brew 'imagemagick'
brew 'libmemcached'
brew 'meilisearch'
brew 'memcached'
brew 'mysql'
brew 'nginx'
brew 'node'
brew 'redis'
brew 'yarn'

# Apps
cask '1password'
cask 'alfred'
cask 'appcleaner'
cask 'arq'
cask 'atom'
cask 'brave-browser'
cask 'calibre'
cask 'carbon-copy-cloner'
cask 'dbngin'
cask 'discord'
cask 'docker'
cask 'dropbox'
cask 'firefox'
cask 'firefox-developer-edition'
cask 'flux'
cask 'github'
cask 'google-chrome'
cask 'grandperspective'
cask 'iina'
cask 'iterm2'
cask 'keepassxc'
cask 'keka'
cask 'microsoft-edge'
cask 'monitorcontrol'
cask 'numi'
cask 'obsidian'
cask 'phpmon'
cask 'phpstorm'
cask 'rectangle'
cask 'setapp'
cask 'scapple'
cask 'sdformatter'
cask 'signal'
cask 'slack'
cask 'sourcetree'
cask 'sublime-merge'
cask 'sublime-text'
cask 'syncthing'
cask 'textmate'
cask 'transmission'
cask 'vagrant'
cask 'vagrant-manager'
cask 'virtualbox'
cask 'visual-studio-code'
cask 'vlc'


# Quicklook
cask 'qlmarkdown'
cask 'quicklook-json'

# Fonts
cask 'font-jetbrains-mono-nerd-font'
cask 'font-fira-code'
cask 'font-proza-libre'


# Mac App Store
mas 'Paprika Recipe Manager 3', id: 1303222628
mas 'Pixelmator Pro', id: 1289583905
mas 'Disk Speed Test', id: 425264550
mas 'Amphetamine', id: 937984704
mas 'Bear', id: 1091189122
mas 'Gestimer', id: 990588172
mas 'Parcel', id: 639968404
mas 'Deliveries', id: 290986013
